&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Если Пароль<>ПодтверждениеПароля Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пароли не совпадают"); 
		Возврат;
	КонецЕсли;
	
	lvlapp_Авторизация.ЗаписатьПароль(Пользователь, Пароль); 
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь =  Параметры.Пользователь;     
	Заголовок = "" +  Пользователь;
	  	
КонецПроцедуры
